app/models/character.rb

SELECT `maps`.* FROM `maps` ORDER BY `maps`.`id` ASC LIMIT 1
SELECT `spots`.* FROM `spots` ORDER BY `spots`.`id` ASC LIMIT 1
---
  def set_default_values
    self.level = 1
    self.experience = 0
    self.points = 0
    self.active = false

    character_type.set_default_stats!(self)

    self.max_health = character_type.calculate_health(self)
    self.current_health ||= self.max_health

    self.max_mana = character_type.calculate_mana(self)
    self.current_mana ||= self.max_mana
    self.map_id = Map.first.id # Lorencia
    self.spot_id = Spot.first.id # Lorencia City