cmo/app/controllers/application_controller.rb

  def authenticate_user_from_session
    User.find_by(id: session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1