cmo/app/controllers/characters_controller.rb

SELECT `characters`.* FROM `characters` WHERE `characters`.`user_id` = 1 AND `characters`.`id` = 1 LIMIT 1
---
  def show
    begin
      @character = current_user.characters.find(params[:id])

INSERT INTO `characters` (`name`, `profession`, `level`, `experience`, `points`, `current_health`, `max_health`, `current_mana`, `max_mana`, `strength`, `agility`, `vitality`, `energy`, `active`, `user_id`, `created_at`, `updated_at`, `map_id`, `spot_id`) VALUES ('AWiz', 'dark_wizard', 1, 0, 0, 60, 60, 60, 60, 18, 18, 15, 30, FALSE, 1, '2024-09-03 09:07:59.869361', '2024-09-03 09:07:59.869361', 1, 1)
---
  def create
    @character = current_user.characters.build(create_character_params)
    logger.debug(@character)
    if @character.save

SELECT `characters`.* FROM `characters` WHERE `characters`.`user_id` = 1 AND `characters`.`id` = 1 LIMIT 1
---
  def activate
    begin
      character = current_user.characters.find(params[:id])