cmo/app/controllers/registrations_controller.rb

  def create
    @user = User.new(registration_params)
    if @user.save
---
INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`, `active_character_id`) VALUES ('Admin', 'admin@example.com', '$2a$12$O3QYTEx/c7ozmY1rJtlgdeZWARuL7Yo0uXutWBu66gUQ0x/RXalQy', '2024-09-03 09:07:50.033902', '2024-09-03 09:07:50.033902', NULL)